# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew "htop-osx"
brew 'mackup'
brew 'mas'
brew 'node'
brew 'tree'
brew 'trash'
brew 'wget'

# Apps
cask '1password'
cask 'bittorrent'
cask 'alfred'
cask 'coda'
cask 'dropbox'
cask 'evernote'
cask 'filezilla'
cask 'firefox'
cask 'google-chrome'
cask 'gdrive'
cask 'handbrakecli'
cask 'iterm2'
cask 'mou'
cask 'namechanger'
cask 'plex-media-server'
cask 'screaming-frog-seo-spirder'
cask 'sequel-pro'
cask 'screencloud'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'tunnelblick'
cask 'vagrant'
cask 'vlc'

# Quicklook
cask "betterzipql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Install Mac App Store apps
# Note: Flycut is an outdated release in MAS, however there won't be a brew cask until 2.0 is released (https://github.com/TermiT/Flycut/issues/38)
mas 'flycut', id: 442160987
mas 'integrity', id: 513610341 